Repository: Hansuqwer/MineCraftModsAIPowered
Catalog: lib/l10n/app_*.arb
Languages: sv

# welcomeMessage
source: Welcome to Crafta! I'm here to help you create amazing creatures and furniture for Minecraft!
sv: Välkommen till Crafta! Jag är här för att hjälpa dig skapa fantastiska varelser och möbler för Minecraft!

# creatorTitle
source: Crafta Creator
sv: Crafta Skapare

source: Hold to speak
sv: Håll för att prata

# listening
source: Listening... Speak now!
sv: Lyssnar... Prata nu!

# typeToCreate
source: Type what you want to create...
sv: Skriv vad du vill skapa...

source: Send
sv: Skicka

# creating
source: Creating your creature...
sv: Skapar din varelse...

# thisMightTakeMoment
source: This might take a moment...
sv: Det här kan ta en stund...

# greatCreating
source: Great! Creating your {creatureType}...
sv: Bra! Skapar din {creatureType}...

# gotItTellMeMore
source: Got it! Tell me more about your creature...
sv: Jag förstår! Berätta mer om din varelse...

# somethingWentWrong
source: Something went wrong. Please try again!
sv: Något gick fel. Försök igen!

# suggestionLoaded
source: Suggestion loaded: {suggestion}
sv: Förslag laddat: {suggestion}

# greatIdeaLetsCreate
source: Great idea! Let's create that!
sv: Bra idé! Låt oss skapa det!

source: Send to Minecraft
sv: Skicka till Minecraft

source: Exporting...
sv: Exporterar...

# exportCompleted
source: Export completed successfully!
sv: Export slutförd framgångsrikt!

# exportFailed
source: Export failed. Please try again.
sv: Export misslyckades. Försök igen.

source: Make Another
sv: Gör en till

source: Tap to create!
sv: Tryck för att skapa!

source: Language
sv: Språk
